var name = "مناسبت های رسمی ایران"
var events = [[], [], [], [], [], [], [], [], [], [], [], [], []];

events[1][1] = ['عید نوروز', true];
events[1][2] = ['عید نوروز', true];
events[1][3] = ['عید نوروز', true];
events[1][4] = ['عید نوروز', true];
events[1][12] = ['روز جمهوری اسلامی', true];
events[1][13] = ['روز طبیعت', true];
events[1][29] = ['روز ارتش جمهوری اسلامی ایران', false];
events[3][14] = ['رحلت امام خمینی', true];
events[3][15] = ['قیام خونین ۱۵ خرداد', true];
events[4][7] = ['شهادت دکتر بهشتی', false];
events[6][8] = ['روز مبارزه با تروریسم', false];
events[9][16] = ['روز دانشجو', false];
events[9][30] = ['شب یلدا', false];
events[11][22] = ['پیروزی انقلاب اسلامی', true];
events[12][29] = ['روز ملی شدن صنعت نفت', true];
