var appTitle = "Taghvim";
var leftArrow = "qrc:/Images/leftAngleArrow.png";
var rightArrow = "qrc:/Images/rightAngleArrow.png";
var appColor = "#efece8"

var imgHoliday ="qrc:/Images/holiday.svg"
var imgIran ="qrc:/Images/iran.svg"
var imgKsa ="qrc:/Images/ksa.svg"
var imgLonar ="qrc:/Images/lonar.svg"
var imgNational ="qrc:/Images/national.svg"
var imgUsa ="qrc:/Images/usa.svg"
var imgWorld ="qrc:/Images/world.svg"
var imgPersonage="qrc:/Images/personage.svg"
var imgWhatsThis ="qrc:/Images/questionMark.svg"
var imgClose ="qrc:/Images/close.svg"

var phYear = "Year"
var phMonth = "Month"
var phDay = "Day"

var jalaliTitle = "گاه‌شماری جلالی"
var gregorianTitle = "گاه‌شماری میلادی"
var hijriTitle = "گاه‌شماری هجری قمری"
var jalaliDesc = "گاه‌شماری جلالی در راستای اصلاح و محاسبه دقیق گاهشماری ایرانی و در پی گاه‌شماری یزدگردی بوجود آمد. بی‌توجهی به اجرای کبیسه‌گیری گاهشماری یزدگردی از سال ۳۷۵ یزدگردی (۱۰۰۶ میلادی) تا اوایل دوران جلال‌الدوله ملک‌شاه سلجوقی موجب شده بود، نوروز هجده روز نسبت به زمان واقعی جابجا شود؛ و اعتدال بهاری به جای اول فروردین با نوزدهم فروردین منطبق شود. از این رو با حذف هجده روز آغاز فروردین و اعمال آن به عنوان کبیسه در پایان سال ۴۴۷ یزدگردی و قرار گرفتن موقعیت ورود خورشید به نقطه اعتدال بهاری در سرآغاز سال، گاهشماری جلالی شکل گرفت \n
گاهشماری جلالی توسط عده‌ای از ریاضی دانان ایرانی از جمله ابوالفتح عبدالرحمان منصور خازنی، ابومظفر اسفزاری، ابوعباس لوکری، محمد بن احمد معموری، میمون بن نجیب واسطی، ابن کوشک بیهقی مباهی و در رأس آنان حکیم عمر خیام در ۳ رمضان ۴۷۱ هجری قمری تدوین شد \n
گاهشماری جلالی تا پیش از مشروطه در ایران رسمیت نداشت و با تغییراتی از جمله در مبدأ و اسامی و طول ماه‌ها در قالب تقویم هجری شمسی برجی از سال ۱۳۲۹ هجری قمری برابر با ۱۲۸۹ هجری خورشیدی در ایران به کار رفته و سپس با تغییراتی در قالب تقویم هجری شمسی در سال ۱۳۰۴ خورشیدی کلیات آن به همراه نامهای فارسی برای ماه‌ها و تعدیل طول ماه‌ها به تصویب مجلس شورای ملی گاه‌شماری رسمی ایران شد. گاهشماری ایران و گاهشماری افغانستان بر پایه گاهشماری جلالی ساخته شده‌اند ولی هم درازای ماه‌هایشان و هم آغاز تاریخشان با گاهشماری جلالی دگرگونی دارد. \n
سال مبدأ گاه‌شماری جلالی، سال جلوس ملکشاه بر تخت سلطنت است که تفاضل آن با گاه‌شماری هجری خورشیدی ۴۵۷ سال می‌باشد. \n
روز سرآغاز این گاه‌شماری، اول فروردین سال ۱ جلالی (۴۵۸ هجری خورشیدی)، برابر نهم رمضان سال ۴۷۱ هجری قمری قراردادی (دهم رمضان سال ۴۷۱ هجری قمری هلالی) و مطابق با ۱۵ مارس ۱۰۷۹ میلادی جولیانی (۲۱ مارس ۱۰۷۹ میلادی گرگوری) است. در این گاهشماری روز اول سال طوری تنظیم شده‌است که با برابری بهاری که نوروز نامیده می‌شود، همگام شود و در پایان سال‌ها ۳۶۵ یا ۳۶۶ روز دارند.
"
var gregorianDesc = "گاه‌شماری میلادی گاه‌شماری با ریشهٔ مسیحی است که هم‌اکنون در بیشتر کشورهای جهان استفاده می‌شود و تقویمی بین‌المللی است. این گاه‌شماری برگرفته از گاه‌شماری ژولینی با مبدأ میلادی (میلاد عیسی) است و نخست از سوی آلویسیوس لیلیوس که پزشکی از اهالی ناپل بود پیشنهاد شد. تعدیل کبیسه‌گیری این گاهشماری در ۲۴ فوریهٔ ۱۵۸۲ از سوی پاپ گریگوری سیزدهم پذیرفته شد و از آن پس به گاه‌شماری گریگوری (گرِگوری) نیز مشهور شد. \n
گاه‌شماری ژولینی که از گاه‌شماری رومی گرفته شده بود در دورهٔ مسیحی با مبدأ میلادی (گاه‌شماری میلادی قدیم) پذیرفته شد. این گاه‌شماری ۳۶۵ روز بود که برای هر ۴ سال یک روز به روزهای سال اضافه می‌شد (سال ۳۶۵٫۲۵ روزه). به علت دقیق نبودن کسر سال نسبت به سال اعتدالی هر ۱۲۸ سال یک روز عقب می‌افتاد. در سال ۱۵۸۲ میلادی جهت تصحیح آن گاه‌شماری گرگوری (میلادی جدید) ایجاد شد. در گاه‌شماری یولیانی اعتدال بهاری در سال ۳۲۵ میلادی که شورای نقیه تشکیل شده بود در ۲۱ مارس صورت گرفته بود و در سال ۱۵۸۲ به ۱۱ مارس افتاده بود و ده روز عقب مانده بود. در گاه‌شماری گرگوری ده روز از تاریخ حذف گردید و کبیسه‌گیری‌های یکنواخت چهارساله نسبتاً کاهش یافت بدینگونه که سال‌های قرن غیرقابل قسمت به ۴۰۰ (مانند: ۱۷۰۰، ۱۸۰۰ و ۱۹۰۰) بدون کبیسه‌گیری باشند. درنتیجه، با احتساب سال گریگوری ۳۶۵٫۲۴۲۵ روز (نسبت به سال حقیقی ۳۶۵٫۲۴۲۱۹۸۷۹ روز) میزان دقت گاه‌شماری میلادی را به عقب‌ماندگیِ یک روز در هر ۳٬۳۲۰ سال رساند
"
var hijriDesc ="گاه‌شماری هجری قمری، گاه‌شماری براساس چرخش ماه است که توسط مسلمانان و نیز در بسیاری از کشورهای اسلامی به عنوان سالنمای مذهبی یا در مواردی سالنمای مدنی استفاده می‌شود. از این سالنمای در بسیاری از آیین‌های اسلامی، از قبیل روزه، حج، تعیین ماه‌های حرام، و عزاداری استفاده می‌شود. در زمان خلافت عمر بن خطاب، خلیفه دوم برای اداره ممالک مفتوحه با کمک دبیران ایرانی اقدام به تأسیس دیوانخانه به سبک ساسانی نمود از اولین اقدامات دبیران ایجاد مبدأ گاه شماری برای سررسید باژ و گزیه (بعدها باج و خراج و جزینه) به تقلید از مبدأ تاریخ یزدجردی بود برای همین تاریخ هجرت پیامبر اسلام جایگزین تاریخ تاجگذاری شاه ساسانی شد که ۱۶ سال با هم اختلاف داشتند\n
قبل از جهانی شدن گاه‌شماری میلادی در بسیاری از کشورهای اسلامی و رسمی شدن گاه‌شماری هجری خورشیدی در ایران و افغانستان، سالنمای هجری قمری سالنمای اصلی سرزمین‌های اسلامی بود و وقایع تاریخی در اکثر قریب به اتفاق موارد با این گاه‌شماری ثبت می‌شد. \n
گاهشماری قمری در میان اعراب پیش از اسلام رواج داشت در ابتدا ماهی افزوده به نام نسی نیز وجود داشته که تقریباً هر سه سال بنحوی در گاه‌شماری قمری قرار می‌گرفته که ماه‌ها همواره در یک سال خورشیدی قرار گیرند. اما در سال ۱۰ هجری پس آمدن آیهٔ ۳۶ و ۳۷ سورهٔ توبه مبنی بر اینکه تعداد ماه‌های سال نزد خداوند دوازده ماه می‌باشد، استفاده از این ماه منسوخ شد.

گاه‌شماری هجری قمری از همان ابتدای مهاجرت مسلمانان از مکه به مدینه معمول نشده‌است بلکه ۱۵ سال بعد از تاریخ هجرت محمد و در زمان خلافت عمر بن خطاب، خلیفهٔ دوم به رسمیت شناخته شد. مشهور است که مسلمانان صدر اسلام بنابر پیشنهاد علی بن ابی طالب و تصویب خلیفه وقت، هجرت سرنوشت ساز پیامبر اسلام از مکه به مدینه را مبدأ سال قمری قرار داده‌اند. بدین جهت، تاریخ قمری را تاریخ هجری قمری نامیده‌اند. \n

"
